# StructuralSectionGeneralU Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralU Class
Members See Also
---
Defines parameters for general Channel shape.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class StructuralSectionGeneralU : StructuralSectionHotRolled
```

Visual Basic
---
```text
Public Class StructuralSectionGeneralU _
	Inherits StructuralSectionHotRolled
```

Visual C++
---
```text
public ref class StructuralSectionGeneralU : public StructuralSectionHotRolled
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionHotRolled Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralU Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionCParallelFlange Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionCSlopedFlange
# See Also
StructuralSectionGeneralU Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace